app/controllers/dashboard_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."user_id" = 1
---
  def index
	@songs = Song.where(user_id: current_user.id)

INSERT INTO "songs" ("album", "artist", "created_at", "genre", "musicfile", "title", "track", "updated_at", "user_id", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
	#@song=Song.new(params[:song])
	@song=Song.new(create_params)
	@song.user_id=current_user.id #should not be sent from view
	if(params[:song][:musicfile] != nil)
		uploader = MusicfileUploader.new(@song,:musicfile)
        	#uploader.set_userid(current_user.id)
		uploader.store!(params[:song][:musicfile])

		TagLib::MPEG::File.open(uploader.url) do |file| #sau @song.musicfile - nu merge deloc, uploader.url merge doar dupa ce fisierul a fost salvat
    			tag = file.id3v2_tag
			@song.title = tag.title
			@song.artist = tag.artist
			@song.album = tag.album
			@song.genre = tag.genre
			@song.year = tag.year
			@song.track = tag.track
		end
		#@song.save
		#uploader.store!(params[:song][:musicfile])
		@song.save

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
	@song2 = Song.find(params[:id])

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "songs" SET "genre" = ?, "year" = ?, "musicfile" = ?, "updated_at" = ? WHERE "songs"."id" = 3  [["genre", ""], ["year", 2010], ["musicfile", "3.mp3"], ["updated_at", Sun, 15 Dec 2013 15:14:30 UTC +00:00]]
---
  def update
	@song2=Song.find(params[:id])
	@song3=Song.new(update_params)
	@song2.update({:title => @song3.title , :artist => @song3.artist , :album => @song3.album , :genre =>  @song3.genre , :track => @song3.track , :year =>  @song3.year })

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 1]]
---
  def destroy
	@song=Song.find(params[:id])
	if( @song.present? )
		@song.destroy

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", "4"]]
---
  def download
	  @song = Song.find(params[:id])