app/controllers/home_controller.rb

SELECT "songs".* FROM "songs"
---
  def find
    if params[:word].present?
      @songs = Song.where("title like ?", "%#{params[:word]}%")
    else
      @songs = Song.all