app/controllers/searchbar_controller.rb

  def create
     if params[:searchstring].present?
      @songs = Song.where("title like ?", "%#{params[:searchstring]}%")
      @searchstring = params[:searchstring]
    else
      @songs = Song.all
---
SELECT "songs".* FROM "songs" WHERE (title like '%fhg%')
SELECT "songs".* FROM "songs"

  def save_comm
  	@comm = Comment.new()
 	@comm.content = params[:comment][:content]
	@comm.user_id = current_user.id
	@comm.song_id = params[:song_id]
	@comm.save
---
INSERT INTO "comments" ("content", "created_at", "song_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "fdth"], ["created_at", Sun, 15 Dec 2013 14:37:29 UTC +00:00], ["song_id", 1], ["updated_at", Sun, 15 Dec 2013 14:37:29 UTC +00:00], ["user_id", 1]]